vvpai9/Keil/Keil_v5/ARM/INC/ADI/ADuC7121.h
// ===============================================																																																																																				
// ADuC7121 HEADER FILE REV 1.6 17th January 2013																																																																																				
// ===============================================																																																																																				



// Interrupt Controller

#define          INTBASE                                    (*(volatile unsigned long      *) 0xFFFF0000)
// Read only values of current masked IRQs
#define          IRQSTA                                     (*(volatile unsigned long      *) 0xFFFF0000)
// Read only values of current un-masked IRQs
#define          IRQSIG                                     (*(volatile unsigned long      *) 0xFFFF0004)
// IRQ Enable
#define          IRQEN                                      (*(volatile unsigned long      *) 0xFFFF0008)
// IRQ Clr
#define          IRQCLR                                     (*(volatile unsigned long      *) 0xFFFF000C)
// "IRQ Request Write sets IRQ, FIQ for bit position ‘0’"
#define          SWICFG                                     (*(volatile unsigned long      *) 0xFFFF0010)
// Used to indicate where in memory the vectors are stored.
#define          IRQBASE                                    (*(volatile unsigned long      *) 0xFFFF0014)
// IRQ interrupt vector
#define          IRQVEC                                     (*(volatile unsigned long      *) 0xFFFF001C)
// Set the interrupt priority
#define          IRQP0                                      (*(volatile unsigned long      *) 0xFFFF0020)
// Set the interrupt priority
#define          IRQP1                                      (*(volatile unsigned long      *) 0xFFFF0024)
// Set the interrupt priority
#define          IRQP2                                      (*(volatile unsigned long      *) 0xFFFF0028)
// Set the interrupt priority
#define          IRQP3                                      (*(volatile unsigned long      *) 0xFFFF002C)
// When asserted interrupt nesting is enabled for FIQ's or IRQ's
#define          IRQCONN                                    (*(volatile unsigned long      *) 0xFFFF0030)
// Determines if an interrupt is trrigger on rising/falling edge or low/high level.
#define          IRQCONE                                    (*(volatile unsigned long      *) 0xFFFF0034)
// Write a 1 to location to clear an interrupt that was triggered off an edge.
#define          IRQCLRE                                    (*(volatile unsigned long      *) 0xFFFF0038)
// Write/read the IRQ nest status for IRQ.
#define          IRQSTAN                                    (*(volatile unsigned long      *) 0xFFFF003C)
// Read only value of selected masked FIQ
#define          FIQSTA                                     (*(volatile unsigned long      *) 0xFFFF0100)
// Read only value of selected un-masked FIQ
#define          FIQSIG                                     (*(volatile unsigned long      *) 0xFFFF0104)
// FIQ Enable
#define          FIQEN                                      (*(volatile unsigned long      *) 0xFFFF0108)
// Write clears FIQ mask for each bit equal to logical ‘1’
#define          FIQCLR                                     (*(volatile unsigned long      *) 0xFFFF010C)
// Read the FIQ interrupt vector.
#define          FIQVEC                                     (*(volatile unsigned long      *) 0xFFFF011C)
// Write/Read the FIQ Nest status for FIQ's
#define          FIQSTAN                                    (*(volatile unsigned long      *) 0xFFFF013C)

// Remap and System Control

#define          REMAPBASE                                  (*(volatile unsigned long      *) 0xFFFF0200)
#define          REMAP                                      (*(volatile unsigned long      *) 0xFFFF0220)
#define          RSTSTA                                     (*(volatile unsigned long      *) 0xFFFF0230)
#define          RSTCLR                                     (*(volatile unsigned long      *) 0xFFFF0234)
#define          RSTCFGKEY0                                 (*(volatile unsigned long      *) 0xFFFF0248)
#define          RSTCFG                                     (*(volatile unsigned long      *) 0xFFFF024C)
#define          RSTCFGKEY1                                 (*(volatile unsigned long      *) 0xFFFF0250)

// 48bit General Purpose Timer 0

#define          TIMER0BASE                                 (*(volatile unsigned long      *) 0xFFFF0300)
#define          T0LD                                       (*(volatile unsigned long      *) 0xFFFF0300)
#define          T0VAL0                                     (*(volatile unsigned long      *) 0xFFFF0304)
#define          T0VAL1                                     (*(volatile unsigned long      *) 0xFFFF0308)
#define          T0CON                                      (*(volatile unsigned long      *) 0xFFFF030C)
#define          T0CLRI                                     (*(volatile unsigned long      *) 0xFFFF0310)
#define          T0CAP                                      (*(volatile unsigned long      *) 0xFFFF0314)

// General Purpose Timer 1

#define          TIMER1BASE                                 (*(volatile unsigned long      *) 0xFFFF0320)
#define          T1LD                                       (*(volatile unsigned long      *) 0xFFFF0320)
#define          T1VAL                                      (*(volatile unsigned long      *) 0xFFFF0324)
#define          T1CON                                      (*(volatile unsigned long      *) 0xFFFF0328)
#define          T1CLRI                                     (*(volatile unsigned long      *) 0xFFFF032C)
#define          T1CAP                                      (*(volatile unsigned long      *) 0xFFFF0330)

// Wake Up Timer

#define          TIMER2BASE                                 (*(volatile unsigned long      *) 0xFFFF0340)
#define          T2LD                                       (*(volatile unsigned long      *) 0xFFFF0340)
#define          T2VAL                                      (*(volatile unsigned long      *) 0xFFFF0344)
#define          T2CON                                      (*(volatile unsigned long      *) 0xFFFF0348)
#define          T2CLRI                                     (*(volatile unsigned long      *) 0xFFFF034C)

// Watchdog Timer

#define          TIMER3BASE                                 (*(volatile unsigned long      *) 0xFFFF0360)
#define          T3LD                                       (*(volatile unsigned long      *) 0xFFFF0360)
#define          T3VAL                                      (*(volatile unsigned long      *) 0xFFFF0364)
#define          T3CON                                      (*(volatile unsigned long      *) 0xFFFF0368)
#define          T3CLRI                                     (*(volatile unsigned long      *) 0xFFFF036C)

// General Purpose Timer 4

#define          TIMER4BASE                                 (*(volatile unsigned long      *) 0xFFFF0380)
#define          T4LD                                       (*(volatile unsigned long      *) 0xFFFF0380)
#define          T4VAL                                      (*(volatile unsigned long      *) 0xFFFF0384)
#define          T4CON                                      (*(volatile unsigned long      *) 0xFFFF0388)
#define          T4CLRI                                     (*(volatile unsigned long      *) 0xFFFF038C)
#define          T4CAP                                      (*(volatile unsigned long      *) 0xFFFF0390)

