vvpai9/Keil/Keil_v5/ARM/INC/ADI/ADuC7121.h
// PLL and Oscillator Control

#define          PLLBASE                                    (*(volatile unsigned long      *) 0xFFFF0400)
#define          POWKEY1                                    (*(volatile unsigned long      *) 0xFFFF0404)
#define          POWCON                                     (*(volatile unsigned long      *) 0xFFFF0408)
#define          POWKEY2                                    (*(volatile unsigned long      *) 0xFFFF040C)
#define          PLLKEY1                                    (*(volatile unsigned long      *) 0xFFFF0410)
#define          PLLCON                                     (*(volatile unsigned long      *) 0xFFFF0414)
#define          PLLKEY2                                    (*(volatile unsigned long      *) 0xFFFF0418)

// Power Supply Monitor

#define          PSMBASE                                    (*(volatile unsigned long      *) 0xFFFF0440)
#define          PSMCON                                     (*(volatile unsigned long      *) 0xFFFF0440)

// Band Gap Reference

#define          BANDGAPBASE                                (*(volatile unsigned long      *) 0xFFFF0480)
#define          REFCON                                     (*(volatile unsigned long      *) 0xFFFF0480)

// ADC interface registers

#define          ADCBASE                                    (*(volatile unsigned long      *) 0xFFFF0500)
#define          ADCCON                                     (*(volatile unsigned long      *) 0xFFFF0500)
#define          ADCCP                                      (*(volatile unsigned long      *) 0xFFFF0504)
#define          ADCCN                                      (*(volatile unsigned long      *) 0xFFFF0508)
#define          ADCSTA                                     (*(volatile unsigned long      *) 0xFFFF050C)
#define          ADCDAT                                     (*(volatile unsigned long      *) 0xFFFF0510)
#define          ADCRST                                     (*(volatile unsigned long      *) 0xFFFF0514)
#define          ADCGN                                      (*(volatile unsigned long      *) 0xFFFF0518)
#define          ADCOF                                      (*(volatile unsigned long      *) 0xFFFF051C)
#define          PGAGN                                      (*(volatile unsigned long      *) 0xFFFF0520)

// DAC Interface Peripheral

#define          DACBASE                                    (*(volatile unsigned long      *) 0xFFFF0580)
// DAC0 Control Register
#define          DAC0CON                                    (*(volatile unsigned long      *) 0xFFFF0580)
// DAC0 Data Register
#define          DAC0DAT                                    (*(volatile unsigned long      *) 0xFFFF0584)
// DAC1 Control Register
#define          DAC1CON                                    (*(volatile unsigned long      *) 0xFFFF0588)
// DAC1 Data Register
#define          DAC1DAT                                    (*(volatile unsigned long      *) 0xFFFF058C)
// DAC2 Control Register
#define          DAC2CON                                    (*(volatile unsigned long      *) 0xFFFF05B0)
// DAC2 Data Register
#define          DAC2DAT                                    (*(volatile unsigned long      *) 0xFFFF05B4)
// DAC3 Control Register
#define          DAC3CON                                    (*(volatile unsigned long      *) 0xFFFF05D8)
// DAC3 Data Register
#define          DAC3DAT                                    (*(volatile unsigned long      *) 0xFFFF05DC)

// IDAC Interface Peripheral

#define          IDACBASE                                   (*(volatile unsigned long      *) 0xFFFF0700)
#define          IDAC0CON                                   (*(volatile unsigned long      *) 0xFFFF0700)
#define          IDAC0DAT                                   (*(volatile unsigned long      *) 0xFFFF0704)
#define          IDAC0BW                                    (*(volatile unsigned long      *) 0xFFFF0708)
#define          IDAC1CON                                   (*(volatile unsigned long      *) 0xFFFF070C)
#define          IDAC1DAT                                   (*(volatile unsigned long      *) 0xFFFF0710)
#define          IDAC1BW                                    (*(volatile unsigned long      *) 0xFFFF0714)
#define          IDAC2CON                                   (*(volatile unsigned long      *) 0xFFFF0718)
#define          IDAC2DAT                                   (*(volatile unsigned long      *) 0xFFFF071C)
#define          IDAC2BW                                    (*(volatile unsigned long      *) 0xFFFF0720)
#define          IDAC3CON                                   (*(volatile unsigned long      *) 0xFFFF0724)
#define          IDAC3DAT                                   (*(volatile unsigned long      *) 0xFFFF0728)
#define          IDAC3BW                                    (*(volatile unsigned long      *) 0xFFFF072C)
#define          IDAC4CON                                   (*(volatile unsigned long      *) 0xFFFF0730)
#define          IDAC4DAT                                   (*(volatile unsigned long      *) 0xFFFF0734)
#define          IDAC4BW                                    (*(volatile unsigned long      *) 0xFFFF0738)
#define          TSDCON                                     (*(volatile unsigned long      *) 0xFFFF073C)
#define          IDACSTA                                    (*(volatile unsigned long      *) 0xFFFF0740)
#define          IDAC0PULLDOWN                              (*(volatile unsigned long      *) 0xFFFF0744)

// 450 Compatible UART core registers

#define          UARTBASE                                   (*(volatile unsigned long      *) 0xFFFF0800)
// Transmit Holding register
#define          COMTX                                      (*(volatile unsigned long      *) 0xFFFF0800)
// Receive Buffer register
#define          COMRX                                      (*(volatile unsigned long      *) 0xFFFF0800)
// Divisor Latch Low byte register
#define          COMDIV0                                    (*(volatile unsigned long      *) 0xFFFF0800)
// Interrupt Enable register
#define          COMIEN0                                    (*(volatile unsigned long      *) 0xFFFF0804)
// Divisor Latch High byte register
#define          COMDIV1                                    (*(volatile unsigned long      *) 0xFFFF0804)
// Interrupt Identification register
#define          COMIID0                                    (*(volatile unsigned long      *) 0xFFFF0808)
// Line Control register
#define          COMCON0                                    (*(volatile unsigned long      *) 0xFFFF080C)
// Module Control register
#define          COMCON1                                    (*(volatile unsigned long      *) 0xFFFF0810)
// Line Status register
#define          COMSTA0                                    (*(volatile unsigned long      *) 0xFFFF0814)
// Fraction divider register.
#define          COMDIV2                                    (*(volatile unsigned long      *) 0xFFFF082C)

