vvpai9/Keil/Keil_v5/ARM/INC/ADI/ADuC7121.h
// I2C0 Port Interface Peripheral

#define          I2C0BASE                                   (*(volatile unsigned long      *) 0xFFFF0880)
// Master control register.
#define          I2C0MCTL                                   (*(volatile unsigned long      *) 0xFFFF0880)
// "Master Status, Error, and IRQ register."
#define          I2C0MSTA                                   (*(volatile unsigned long      *) 0xFFFF0884)
// Master receive data register.
#define          I2C0MRX                                    (*(volatile unsigned long      *) 0xFFFF0888)
// Master transmit data register.
#define          I2C0MTX                                    (*(volatile unsigned long      *) 0xFFFF088C)
// Master receive data count register.
#define          I2C0MCNT0                                  (*(volatile unsigned long      *) 0xFFFF0890)
// Master current receive count register
#define          I2C0MCNT1                                  (*(volatile unsigned long      *) 0xFFFF0894)
// 1st Master Address byte register
#define          I2C0ADR0                                   (*(volatile unsigned long      *) 0xFFFF0898)
// 2nd Master Address byte register
#define          I2C0ADR1                                   (*(volatile unsigned long      *) 0xFFFF089C)
// Start Byte Register
#define          I2C0SBYTE                                  (*(volatile unsigned long      *) 0xFFFF08A0)
// Serial clock period divisor register
#define          I2C0DIV                                    (*(volatile unsigned long      *) 0xFFFF08A4)
// Slave control register
#define          I2C0SCTL                                   (*(volatile unsigned long      *) 0xFFFF08A8)
// Slave status register
#define          I2C0SSTA                                   (*(volatile unsigned long      *) 0xFFFF08AC)
// Slave receive data register
#define          I2C0SRX                                    (*(volatile unsigned long      *) 0xFFFF08B0)
// Slave transmit data register
#define          I2C0STX                                    (*(volatile unsigned long      *) 0xFFFF08B4)
// Slave ALT register
#define          I2C0ALT                                    (*(volatile unsigned long      *) 0xFFFF08B8)
// Slave ID register 0
#define          I2C0ID0                                    (*(volatile unsigned long      *) 0xFFFF08BC)
// Slave ID register 1
#define          I2C0ID1                                    (*(volatile unsigned long      *) 0xFFFF08C0)
// Slave ID register 2
#define          I2C0ID2                                    (*(volatile unsigned long      *) 0xFFFF08C4)
// Slave ID register 3
#define          I2C0ID3                                    (*(volatile unsigned long      *) 0xFFFF08C8)
// FIFO status register
#define          I2C0FSTA                                   (*(volatile unsigned long      *) 0xFFFF08CC)

// I2C1 Port Interface Peripheral

#define          I2C1BASE                                   (*(volatile unsigned long      *) 0xFFFF0900)
// Master control register.
#define          I2C1MCTL                                   (*(volatile unsigned long      *) 0xFFFF0900)
// "Master Status, Error, and IRQ register."
#define          I2C1MSTA                                   (*(volatile unsigned long      *) 0xFFFF0904)
// Master receive data register.
#define          I2C1MRX                                    (*(volatile unsigned long      *) 0xFFFF0908)
// Master transmit data register.
#define          I2C1MTX                                    (*(volatile unsigned long      *) 0xFFFF090C)
// Master receive data count register.
#define          I2C1MCNT0                                  (*(volatile unsigned long      *) 0xFFFF0910)
// Master current receive count register
#define          I2C1MCNT1                                  (*(volatile unsigned long      *) 0xFFFF0914)
// 1st Master Address byte register
#define          I2C1ADR0                                   (*(volatile unsigned long      *) 0xFFFF0918)
// 2nd Master Address byte register
#define          I2C1ADR1                                   (*(volatile unsigned long      *) 0xFFFF091C)
// Start Byte Register
#define          I2C1SBYTE                                  (*(volatile unsigned long      *) 0xFFFF0920)
// Serial clock period divisor register
#define          I2C1DIV                                    (*(volatile unsigned long      *) 0xFFFF0924)
// Slave control register
#define          I2C1SCTL                                   (*(volatile unsigned long      *) 0xFFFF0928)
// Slave status register
#define          I2C1SSTA                                   (*(volatile unsigned long      *) 0xFFFF092C)
// Slave receive data register
#define          I2C1SRX                                    (*(volatile unsigned long      *) 0xFFFF0930)
// Slave transmit data register
#define          I2C1STX                                    (*(volatile unsigned long      *) 0xFFFF0934)
// Slave ALT register
#define          I2C1ALT                                    (*(volatile unsigned long      *) 0xFFFF0938)
// Slave ID register 0
#define          I2C1ID0                                    (*(volatile unsigned long      *) 0xFFFF093C)
// Slave ID register 1
#define          I2C1ID1                                    (*(volatile unsigned long      *) 0xFFFF0940)
// Slave ID register 2
#define          I2C1ID2                                    (*(volatile unsigned long      *) 0xFFFF0944)
// Slave ID register 3
#define          I2C1ID3                                    (*(volatile unsigned long      *) 0xFFFF0948)
// FIFO status register
#define          I2C1FSTA                                   (*(volatile unsigned long      *) 0xFFFF094C)

// Serial Port Interface Peripheral

#define          SPIBASE                                    (*(volatile unsigned long      *) 0xFFFF0A00)
// "Read only SPI Status, Error, and IRQ Register"
#define          SPISTA                                     (*(volatile unsigned long      *) 0xFFFF0A00)
// Read only SPI Receive Data Register
#define          SPIRX                                      (*(volatile unsigned long      *) 0xFFFF0A04)
// Write only SPI Transmit Data Register
#define          SPITX                                      (*(volatile unsigned long      *) 0xFFFF0A08)
// Serial Clock Divisor Register
#define          SPIDIV                                     (*(volatile unsigned long      *) 0xFFFF0A0C)
// Configuration Register
#define          SPICON                                     (*(volatile unsigned long      *) 0xFFFF0A10)

// PROGRAMABLE LOGIC ARRAY

#define          PLABASE                                    (*(volatile unsigned long      *) 0xFFFF0B00)
// PLA Element 0 configuration
#define          PLAELM0                                    (*(volatile unsigned long      *) 0xFFFF0B00)
// PLA Element 1 configuration
#define          PLAELM1                                    (*(volatile unsigned long      *) 0xFFFF0B04)
// PLA Element 2 configuration
#define          PLAELM2                                    (*(volatile unsigned long      *) 0xFFFF0B08)
// PLA Element 3 configuration
#define          PLAELM3                                    (*(volatile unsigned long      *) 0xFFFF0B0C)
// PLA Element 4 configuration
#define          PLAELM4                                    (*(volatile unsigned long      *) 0xFFFF0B10)
// PLA Element 5 configuration
#define          PLAELM5                                    (*(volatile unsigned long      *) 0xFFFF0B14)
// PLA Element 6 configuration
#define          PLAELM6                                    (*(volatile unsigned long      *) 0xFFFF0B18)
// PLA Element 7 configuration
#define          PLAELM7                                    (*(volatile unsigned long      *) 0xFFFF0B1C)
// PLA Element 8 configuration
#define          PLAELM8                                    (*(volatile unsigned long      *) 0xFFFF0B20)
// PLA Element 9 configuration
#define          PLAELM9                                    (*(volatile unsigned long      *) 0xFFFF0B24)
// PLA Element 10 configuration
#define          PLAELM10                                   (*(volatile unsigned long      *) 0xFFFF0B28)
// PLA Element 11 configuration
#define          PLAELM11                                   (*(volatile unsigned long      *) 0xFFFF0B2C)
// PLA Element 12 configuration
#define          PLAELM12                                   (*(volatile unsigned long      *) 0xFFFF0B30)
// PLA Element 13 configuration
#define          PLAELM13                                   (*(volatile unsigned long      *) 0xFFFF0B34)
// PLA Element 14 configuration
#define          PLAELM14                                   (*(volatile unsigned long      *) 0xFFFF0B38)
// PLA Element 15 configuration
#define          PLAELM15                                   (*(volatile unsigned long      *) 0xFFFF0B3C)
// PLA clock select
#define          PLACLK                                     (*(volatile unsigned long      *) 0xFFFF0B40)
// PLA source for irq 0 and irq 1
#define          PLAIRQ                                     (*(volatile unsigned long      *) 0xFFFF0B44)
// PLA source for ADC start convert
#define          PLAADC                                     (*(volatile unsigned long      *) 0xFFFF0B48)
// AMBA bus data input for PLA
#define          PLADIN                                     (*(volatile unsigned long      *) 0xFFFF0B4C)
// AMBA bus data output from PLA
#define          PLAOUT                                     (*(volatile unsigned long      *) 0xFFFF0B50)
// PLA Lock Bit
#define          PLALCK                                     (*(volatile unsigned long      *) 0xFFFF0B54)

// GPIO AND SERIAL PORT MUX

#define          GPIOBASE                                   (*(volatile unsigned long      *) 0xFFFF0D00)
// Enable port 0
#define          GP0CON                                     (*(volatile unsigned long      *) 0xFFFF0D00)
// Enable port 1
#define          GP1CON                                     (*(volatile unsigned long      *) 0xFFFF0D04)
// Enable port 2
#define          GP2CON                                     (*(volatile unsigned long      *) 0xFFFF0D08)
// Enable port 3
#define          GP3CON                                     (*(volatile unsigned long      *) 0xFFFF0D0C)
// GPIO Port0 Data Bit Register
#define          GP0DAT                                     (*(volatile unsigned long      *) 0xFFFF0D20)
// GPIO Port0 Data Bit Set Register
#define          GP0SET                                     (*(volatile unsigned long      *) 0xFFFF0D24)
// GPIO Port0 Data Bit Clear Register
#define          GP0CLR                                     (*(volatile unsigned long      *) 0xFFFF0D28)
// GPIO Port0 CON & DAT register
#define          GP0PAR                                     (*(volatile unsigned long      *) 0xFFFF0D2C)
// GPIO Port1 Data Bit Register
#define          GP1DAT                                     (*(volatile unsigned long      *) 0xFFFF0D30)
// GPIO Port1 Data Bit Set Register
#define          GP1SET                                     (*(volatile unsigned long      *) 0xFFFF0D34)
// GPIO Port1 Data Bit Clear Register
#define          GP1CLR                                     (*(volatile unsigned long      *) 0xFFFF0D38)
// GPIO Port1 CON & DAT register
#define          GP1PAR                                     (*(volatile unsigned long      *) 0xFFFF0D3C)
// GPIO Port2 Data Bit Register
#define          GP2DAT                                     (*(volatile unsigned long      *) 0xFFFF0D40)
// GPIO Port2 Data Bit Set Register
#define          GP2SET                                     (*(volatile unsigned long      *) 0xFFFF0D44)
// GPIO Port2 Data Bit Clear Register
#define          GP2CLR                                     (*(volatile unsigned long      *) 0xFFFF0D48)
// GPIO Port2 CON & DAT register
#define          GP2PAR                                     (*(volatile unsigned long      *) 0xFFFF0D4C)
// GPIO Port3 Data Bit Register
#define          GP3DAT                                     (*(volatile unsigned long      *) 0xFFFF0D50)
// GPIO Port3 Data Bit Set Register
#define          GP3SET                                     (*(volatile unsigned long      *) 0xFFFF0D54)
// GPIO Port3 Data Bit Clear Register
#define          GP3CLR                                     (*(volatile unsigned long      *) 0xFFFF0D58)
// GPIO Port3 CON & DAT register
#define          GP3PAR                                     (*(volatile unsigned long      *) 0xFFFF0D5C)
// GPIO Port1 OC enable
#define          GP1OCE                                     (*(volatile unsigned long      *) 0xFFFF0D70)
// GPIO Port2 OC enable
#define          GP2OCE                                     (*(volatile unsigned long      *) 0xFFFF0D74)
// GPIO Port3 OC enable
#define          GP3OCE                                     (*(volatile unsigned long      *) 0xFFFF0D78)

// Flash Control Interface 0

#define          FLASH0BASE                                 (*(volatile unsigned long      *) 0xFFFF0E00)
// Command Status Register
#define          FEE0STA                                    (*(volatile unsigned long      *) 0xFFFF0E00)
// Mode Register
#define          FEE0MOD                                    (*(volatile unsigned long      *) 0xFFFF0E04)
// Command Code Interpreter
#define          FEE0CON                                    (*(volatile unsigned long      *) 0xFFFF0E08)
// "Data Register, data to be written or verified (32 bits)"
#define          FEE0DAT                                    (*(volatile unsigned long      *) 0xFFFF0E0C)
// "Command Location Index, memory array sector address"
#define          FEE0ADR                                    (*(volatile unsigned long      *) 0xFFFF0E10)
// Code signature onto 24 bits LFSR
#define          FEE0SGN                                    (*(volatile unsigned long      *) 0xFFFF0E18)
// 32bits used for user write protection
#define          FEE0PRO                                    (*(volatile unsigned long      *) 0xFFFF0E1C)
// "Protection download, writable with key only"
#define          FEE0HID                                    (*(volatile unsigned long      *) 0xFFFF0E20)

